cask_args appdir: '/Applications'

tap 'caskroom/homebrew-cask' || true
brew 'bash-completion'
brew 'coreutils'
brew 'dos2unix'
brew 'fzf'
brew 'git'
brew 'htop'
brew 'hunspell'
brew 'hub'
brew 'imagemagick'
brew 'mas'
brew 'rbenv'
brew 'tmux'
brew 'tree'
brew 'wget'
# Casks
cask 'google-chrome'
cask 'postman'
cask 'visual-studio-code'

# App Store
mas 'Amphetamine', id: 937984704

# client-app dependencies
brew 'geoip'
brew 'geos'
brew 'proj'
brew 'gdal'
tap 'petere/postgresql'
brew 'petere/postgresql/postgresql@11'

