cask_args appdir: '/Applications'

brew 'bash-completion'
brew 'coreutils'
brew 'dos2unix'
brew 'fzf'
brew 'git'
brew 'git-lfs'
brew 'htop'
brew 'hunspell'
brew 'hub'
brew 'imagemagick'
brew 'homebrew/core/make'
brew 'mas'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'tmux'
brew 'tree'
brew 'wget'
# Casks
cask 'colloquy'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'postman'
cask 'slack'
cask 'transmission'
cask 'visual-studio-code'

# App Store
mas 'Amphetamine', id: 937984704

# client-app dependencies
brew 'geoip'
brew 'geos'
brew 'proj'
brew 'gdal'
tap 'petere/postgresql'
brew 'petere/postgresql/postgresql@11'
brew 'petere/postgresql/postgresql-common'

tap 'thoughtbot/formulae'
brew 'rcm'

